
print("Результат выполнения практической работы СТРОКИ")
print()

print("1 задание")
print("Иван Иванович Иванов")
print()

print("2 задание")
print('''А это - "Бунгало" Билла! ''')
print()


print("4 задание")
a = "Test"
b = "Unit"
c = "Doc"

print(a + b + c)
print()

print("5 задание")
print(" Чертовая дюжина" * 13)
print()

print("6 задание")
N = a + b +c
print(N[2],  N[4],  N[8])
print()

print("7 задание")
print(N[:3], N[2: -4], N[-8:])
print()

print("8 задание")
print('Трудная была задача. Многочасовые рассчеты показали то, о чем я'
      ' подозревал и волновался. Отклонение было на {N} процента от нормы.'.format(N=7.9462))
print('Время было {T},когда я подошел к окну, посмотрел вдаль и на окружающий мир. '
      'Погода, люди, природные явления за окном сообщали, что сегодня настало  {PERIOD} !'.format(T="2", PERIOD="лето"))

print("9 задание ")
print('{0:.8}'.format(0b10111 / 0x2a))
print()

print("10 задание")
print("Иван Иванович Иванов".upper())
print(" ")
print()